notes/waves.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Waves</title>
<meta name="generator" content="Org Mode" />
<link rel='stylesheet' href='https://www.haider.gq/base/style.css'/> 
<link rel='stylesheet' href='https://cdnjs.cloudflare.com/ajax/libs/font-awesome/4.7.0/css/font-awesome.min.css' /> 
<link rel='preconnect' href='https://fonts.googleapis.com'> 
<link rel='preconnect' href='https://fonts.gstatic.com' crossorigin> 
<link href='https://fonts.googleapis.com/css2?family=Poppins:ital@1&family=Roboto&display=swap' rel='stylesheet'>
<link href='https://fonts.googleapis.com/css2?family=JetBrains+Mono&display=swap' rel='stylesheet'>
<meta name='keywords' content='development, coding, programming, linux, emacs, guix'>
<link rel='icon' type='image/x-icon' href='/base/favicon.png'>
<meta name='description' content="Haider Mirza's website">
</head>
<body>
<div id="preamble" class="status">

<div class='grid-container'>
  <div class='grid-item header'>

    <a href='https://www.haider.gq' class='Header_Title'>
      <span class='Header_Haider-Mirza'>Haider Mirza</span>
    </a>
    <ul class='Header_links'>
      <li><a href='https://www.haider.gq/blogs/blogs'>Blogs</a></li>
      <li><a href='https://www.haider.gq/repos/repos'>Repositories</a></li>
      <li><a href='https://www.haider.gq/notes'>Notes</a></li>
    </ul>

    <form role='search' id='form'>
      <input type='search' id='query' name='q'
	     placeholder='Search...'
	     aria-label='Search through site content'
	     class='Sidebar_Search'>
    </form>
  </div>

  <div class='grid-item main'>
    <form role='search' id='form'>
      <input type='search' id='query' name='q'
	     placeholder='Search...'
	     aria-label='Search through site content'
	     class='Main_Search'>
    </form>
    <script src='https://www.haider.gq/base/search.js' crossorigin='anonymous'></script>
    <div class='main-main'> <!-- The actual main part -->
</div>
<div id="content" class="content">
<h1 class="title">Waves</h1>

<div id="outline-container-org1ad3cc8" class="outline-2">
<h2 id="org1ad3cc8">Waves</h2>
<div class="outline-text-2" id="text-org1ad3cc8">
<p>
Waves are a way of carrying energy.
</p>
</div>
<div id="outline-container-org9e23a9b" class="outline-3">
<h3 id="org9e23a9b">Types of waves</h3>
<div class="outline-text-3" id="text-org9e23a9b">
<p>
There are many types of identifying different waves.
</p>
</div>
<div id="outline-container-org6c0614b" class="outline-4">
<h4 id="org6c0614b">Mechanical</h4>
<div class="outline-text-4" id="text-org6c0614b">
<p>
Sound waves, water waves, waves on springs and ropes, and seismic waves produced by earthquakes are all mechanical waves which are travel through a medium.
</p>
</div>
</div>

<div id="outline-container-org67ea989" class="outline-4">
<h4 id="org67ea989">Electromagnetic waves</h4>
<div class="outline-text-4" id="text-org67ea989">
<p>
Light waves, radio waves, and microwaves are all examples of electromagnetic waves, which can all travel through a vacuum at the speed at \(3x10^5\) kilometers per second. No medium is needed.
</p>
</div>
</div>

<div id="outline-container-org93e525e" class="outline-4">
<h4 id="org93e525e">Transverse waves</h4>
<div class="outline-text-4" id="text-org93e525e">
<p>
If you put a mark on a rope and you send waves through that rope, the mark would be oscillating perpendicular to the direction of the flow of the waves. All electromagnets are transverse waves.
</p>
</div>
</div>

<div id="outline-container-org3a8bbc3" class="outline-4">
<h4 id="org3a8bbc3">Longitudinal waves</h4>
<div class="outline-text-4" id="text-org3a8bbc3">
<p>
Waves which oscillations are parallel to the direction in which waves transfer energy are called Longitudinal waves.
</p>
</div>
</div>
</div>

<div id="outline-container-org52d8278" class="outline-3">
<h3 id="org52d8278">Properties of waves</h3>
<div class="outline-text-3" id="text-org52d8278">
</div>
<div id="outline-container-orga356632" class="outline-4">
<h4 id="orga356632">Wavelength (\(\lambda\))</h4>
<div class="outline-text-4" id="text-orga356632">
<p>
The wavelength is the distance between the crests of waves and has the symbol of <b>\(/lambda\)</b>.
Wavelength is in meters.
</p>
</div>
</div>

<div id="outline-container-org7588b13" class="outline-4">
<h4 id="org7588b13">Time period (T)</h4>
<div class="outline-text-4" id="text-org7588b13">
<p>
The time period is defined as the amount of time it takes for one complete cycle.
The time period is always measured in seconds.
</p>


<p>
The definition of frequency (in terms of waves) is the amount of cycles completed by the wave in 1 second.
For the waves on a rope, one wave crest passing each second equals the frequency of 1Hz.
As you can probably guess, this is the formula to calculate the frequency:
\(Frequency (v) = \frac{1}{Time (T)}\)
</p>
</div>
</div>
<div id="outline-container-org7733de7" class="outline-4">
<h4 id="org7733de7">Frequency (Hz)</h4>
<div class="outline-text-4" id="text-org7733de7">
<p>
The definition of wave speed (in terms of waves) is the amount of cycles completed by the wave in 1 second.
For the waves on a rope, one wave crest passing each second equals the frequency of 1Hz.
As you can probably guess, this is the formula to calculate the wave speed:
\(Waves speed (v) = \frac{1}{Time (T)}\)
</p>
</div>
</div>

<div id="outline-container-org513f9c7" class="outline-4">
<h4 id="org513f9c7">Amplitude</h4>
<div class="outline-text-4" id="text-org513f9c7">
<p>
The amplitude is the max distance (disturbance) from rest.
</p>
</div>
</div>

<div id="outline-container-orgb5f3ae3" class="outline-4">
<h4 id="orgb5f3ae3">Peak</h4>
<div class="outline-text-4" id="text-orgb5f3ae3">
<p>
The peak is the "top" of a wave max distance from rest going upwards.
</p>
</div>
</div>

<div id="outline-container-orge63c0ce" class="outline-4">
<h4 id="orge63c0ce">Trough</h4>
<div class="outline-text-4" id="text-orge63c0ce">
<p>
The trough is the antithesis of the peak, the "bottom of a wave" or the max distance from rest going downwards.
</p>
</div>
</div>

<div id="outline-container-org74b68ee" class="outline-4">
<h4 id="org74b68ee">Wave speed</h4>
<div class="outline-text-4" id="text-org74b68ee">
<p>
The formula for calculating the wave speed is as follows:
\(v = f \times \lambda\)
wave speed (v) is in meters/second, m/s
</p>
</div>
</div>
</div>
</div>


<div id="outline-container-orgdbb779a" class="outline-2">
<h2 id="orgdbb779a">Links to this note</h2>
<div class="outline-text-2" id="text-orgdbb779a">
<ul class="org-ul">
<li><a href="./circuits.html">Circuits</a></li>
<li><a href="./physics.html">Physics</a></li>
</ul>
</div>
</div>
</div>
<div id="postamble" class="status">
</div>
		    </div>
		<div class='grid-item sidebar'>
		  <h2>Socials</h2>
		  <ul class='sidebar-socials'>
		    <li><a href='mailto:haider@haider.gq'><i class='fa-solid fa-envelope'></i> Email</a></li>
		    <li class='irc' onclick='alert('My Username is Haider,
You can find me in Libera.Chat on these channels:
- #tropin 
- #systemcrafters 
- #guix');'><i class='fa-solid fa-message'></i> IRC/Matrix</li>
		    <li><a href='https://www.github.com/Haider-Mirza'><i class='fa-brands fa-github'></i> Github</a></li>
		  </ul>
		  <h2>Projects</h2>
		  <ul class='sidebar-projects'>
		    <li><a href='https://www.github.com/Haider-Mirza/Spinter'> Spinter</a></li>
		  </ul>
		</div>
		<div class='grid-item footer'>
		  <p>Created by Haider Mirza with orgmode in emacs</p>
		</div>
	      </div>
</div>
</body>
</html>
